<a href="https://colab.research.google.com/github/DevRichan/Fundamental-SQL-Using-FUNCTION-and-GROUP-BY-/blob/master/SCALAR_VS_AGGREGATE.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Fungsi Scalar vs Fungsi Aggregate**

Fungsi adalah metode yang digunakan untuk melakukan operasi data di database. Operasi ini bisa berupa kalkulasi numerik seperti sum, count, avg, etc; atau operasi non-numerik seperti string concatenations dan sub-strings. SQL Function dapat dibagi ke dalam 2 kategori, yaitufungsi scalar dan fungsi aggregate.

Fungsi skalar dalam SQL digunakan untuk mengembalikan nilai tunggal (single value) dari suatu nilai input yang diberikan, sedangkan fungsi agregat dalam SQL digunakan untuk melakukan perhitungan pada sekelompok nilai dan kemudian mengembalikan nilai tunggal. Nah, biar lebih mudah dipahami mari kita bahas dan praktekkan fungsi-fungsi dari kedua kategori ini.â€

1. Fungsi Scalar 



```
# This is formatted as code
```

In [ ]:
#https://dev.mysql.com/doc/refman/8.0/en/mathematical-functions.html

#Number
#SELECT ABS() 
SELECT StudentID, FirstName, LastName, Semester1, Semester2, ABS(MarkGrowth) as markgrowth FROM students			

#SELECT CEILING()
SELECT StudentID, FirstName, LastName, Ceiling(Semester1) as Semester1, CEILING(Semester2) as Semester2, MarkGrowth FROM students;				

#SElECT FLOOR()
SELECT StudentID, FirstName, LastName, FLOOR(Semester1) as Semester1, FLOOR(Semester2) as Semester2, MarkGrowth FROM students;				

#SELCET ROUND()
SELECT StudentID, FirstName, LastName, ROUND(Semester1, 1) as Semester1, ROUND(Semester1, 0) as Semester2, MarkGrowth FROM students;								

#SELECT SQRT()
SELECT StudentID, FirstName, LastName, SQRT(Semester1) as Semester1, Semester2, MarkGrowth FROM students;	


#https://dev.mysql.com/doc/refman/8.0/en/string-functions.html
#String
#SELECT CONCAT
SELECT StudentID, CONCAT(FirstName, LastName) as Name, Semester1, Semester2, MarkGrowth FROM students				

#SELECT SUBSTRING_INDEX
SELECT StudentID, SUBSTRING_INDEX(Email, '@',1) as Name FROM students		
#column --> merupakan nama kolom yang akan dipecah text-nya,
#delimiter --> karakter atau gabungan beberapa karakter untuk pemecah text pada kolom bersangkutan,
#index_to_return --> indeks dari pecahan text yang akan diambil.					

#SELECT SUBSTR()
SELECT StudentId, SUBSTR(FirstName, 2, 3) as Initial FROM students

#SELECT LENGTH()
SELECT StudentID, FirstName, LENGTH(FirstName) as Total_Char FROM students;			

#SELECT REPLACE()
SELECT StudentID, Email, REPLACE(EMAIL, 'yahoo', 'gmail') as New_Email FROM students;

In [ ]:
#Tugas Praktek

SELECT StudentID, FirstName, LastName, MOD(Semester1,2) AS Semester1, Semester2, EXP(MarkGrowth) FROM students
Tugas Praktek
Tugas:
Gunakan fungsi MOD() untuk menghitung nilai sisa jika nilai Semester1 dibagi 2 dan fungsi EXP() untuk menghitung nilai eksponensial dari nilai MarkGrowth. Gunakan kedua fungsi tersebut dalam satu SELECT-Statement. 

#Tugas Praktek 2
Gunakan fungsi UPPER() untuk mengubah kolom FirstName menjadi seluruhnya kapital dan gunakan LOWER() untuk mengubah kolom LastName menjadi seluruhnya non-kapital. Gunakan kedua fungsi tersebut dalam satu SELECT-Statement.

Jika berhasil, berikut output tabel yang diperoleh:
SELECT StudentID, UPPER(FirstName) as FirstName, LOWER(LastName) as LastName FROM students

In [ ]:
print(9 % 4)

1

2. Fungsi Aggregate

In [ ]:
#SELECT SUM
SELECT SUM(Semester1) as Total_1, SUM(Semester2) as Total_2 FROM students				

#SELECT COUNT
SELECT COUNT(FirstName) as Total_Student FROM students

#SELECT AVG
SELECT AVG(Semester1) as AVG_1, AVG(Semester2) as AVG_2 FROM students

In [ ]:
#TUGAS PRAKTEK
#Setelah memahami fungsi-fungsi sebelumnya, kali ini Senja memintaku untuk menggunakan 
#fungsi MIN() dan MAX() untuk menghitung nilai dari kolom Semester1 dan Semester2. 
#Aku menggunakan fungsi tersebut dalam satu SELECT-Statement.
#Jika berhasil, berikut output tabel yang diperoleh:

SELECT MIN(Semester1) as Min1, MAX(Semester1) as MAX1, MIN(Semester2) as Min2 , Max(Semester2) as Max2  FROM students